Revit 2024 API
PickedBox Members
The PickedBox type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Max
Maximum coordinates (upper-right-front corner of the pick box).
Min
Minimum coordinates (lower-left-rear corner of the pick box).
See Also
PickedBox Class
Autodesk.Revit.UI.Selection Namespace